// components/FeedbackForm.js
import React from 'react';
import Image from 'next/image';
import picone from '../../../public/pic-one.png'
import pictwo from '../../../public/pic-two.png'
import picthree from '../../../public/pic-three.png'
import picfour from '../../../public/pic-four.png'
import picfive from '../../../public/pic-five.png'
import feedbacklogo from '../../../public/feedback.svg'

const cards = [
  {
    id:1,
    name: 'علی روشن',
    time: '۱۲ ساعت پیش',
    text: 'نرم افزار خیلی خوبی است. من می‌توانم همه چیز را مدیریت کنم. خیلی ممنون از تیم خوبتان.',
    image: picone,
  },
  {
    id:2,
    name: 'سید محسن حیدری',
    time: '۱۰ ساعت پیش',
    text: 'این نرم افزار زیر و رو کرده است کارهای من. واقعا قابل تحسین است. خیلی تشکر میکنم از تیم عالی شما.',
    image: pictwo,
  },
  {
    id:3,
    name: 'سجاد مطهری',
    time: '۸ ساعت پیش',
    text: 'با توجه به سرعت و دقتی که این نرم افزار دارد، من توانستم بسیاری از مشکلات خود را حل کنم. عالی است!',
    image: picthree,
  },
  {
    id:4,
    name: 'مریم حیدری',
    time: '۶ ساعت پیش',
    text: 'مجموعه خوبی از ابزارها دارد که بسیاری از نیازهای من را برطرف می‌کند.',
    image: picfour,
  },
  {
    id:5,
    name: 'حمید دهقان',
    time: '۲ ساعت پیش',
    text: 'خیلی خوب است. عالی! توصیه میکنم همه استفاده کنند.',
    image: picfive,
  },
]

const Comments = () => {
  return (
    <div className=" bg-gradient-to-t from-[#FFFFFF] min-h-screen rounded-3xl mx-24 mb-20">
      <div className="max-w-7xl mx-auto">
        <h2 className="text-2xl font-bold mb-4 text-center">نظرات شما</h2>
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-5 gap-4 mb-8 ">
          {cards.map((feedback, index) => (
            <div key={index} className={`${index === 2 ? 'scale-100 opacity-100' : 'scale-90 opacity-70 h-50'} p-4 bg-white rounded-xl drop-shadow-xl flex flex-col justify-between`}>
              <div>
                <div className=" transform-gpu flex items-center mb-4">
                  <Image src={feedback.image} alt={feedback.name} className="w-10 h-10 rounded-full ml-4" />
                  <div className='flex items-center justify-center'>
                    <p className="items-center leading-4text-[#6C6C6C] text-[10px]">{feedback.name}</p>
                    <p className="text-[8px] text-[#ACACAC] pr-2">{feedback.time}</p>
                  </div>
                </div>
                <p>{feedback.text}</p>
              </div>
              <div className="mt-4 flex justify-end">
                <div className="flex items-center text-gray-500 text-sm">
                <span>0</span>
                  <button className="flex items-center ml-2">
                  <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.625 7.75L5.24125 7.8525C5.25613 7.763 5.25135 7.67134 5.22723 7.58388C5.20312 7.49642 5.16025 7.41526 5.10161 7.34603C5.04297 7.2768 4.96996 7.22117 4.88766 7.183C4.80535 7.14483 4.71572 7.12504 4.625 7.125V7.75ZM11.5 7.75V8.375C11.6658 8.375 11.8247 8.30915 11.9419 8.19194C12.0592 8.07473 12.125 7.91576 12.125 7.75H11.5ZM10.25 0.875H3.15V2.125H10.25V0.875ZM2.4 8.375H4.625V7.125H2.4V8.375ZM4.00813 7.6475L3.505 10.6694L4.7375 10.875L5.24125 7.8525L4.00813 7.6475ZM4.7375 12.125H4.87125V10.875H4.7375V12.125ZM6.95188 11.0119L8.52313 8.65312L7.48313 7.95937L5.91063 10.3181L6.95188 11.0119ZM9.04375 8.375H11.5V7.125H9.04375V8.375ZM12.125 7.75V2.75H10.875V7.75H12.125ZM1.31125 2.3825L0.561251 6.1325L1.78625 6.3775L2.53625 2.6275L1.31125 2.3825ZM8.52313 8.65312C8.58022 8.56755 8.65818 8.4974 8.74889 8.44888C8.8396 8.40036 8.94088 8.37498 9.04375 8.375V7.125C8.73508 7.12502 8.4312 7.20125 8.15906 7.34691C7.88692 7.49257 7.65433 7.70254 7.48313 7.95937L8.52313 8.65312ZM3.505 10.6694C3.47514 10.8484 3.48463 11.0318 3.53281 11.2068C3.581 11.3818 3.66671 11.5442 3.784 11.6827C3.90129 11.8213 4.04735 11.9326 4.21201 12.009C4.37667 12.0853 4.55599 12.1249 4.7375 12.125V10.875L3.505 10.6694ZM2.4 7.125C2.30752 7.12504 2.21618 7.10455 2.13257 7.06501C2.04896 7.02547 1.97517 6.96787 1.91652 6.89637C1.85786 6.82486 1.81581 6.74123 1.79339 6.6515C1.77097 6.56177 1.76812 6.46819 1.78625 6.3775L0.561251 6.1325C0.50689 6.40447 0.513541 6.68511 0.580727 6.9542C0.647911 7.22329 0.773956 7.47412 0.949777 7.68862C1.1256 7.90312 1.34681 8.07594 1.59748 8.19463C1.84815 8.31332 2.12265 8.37492 2.4 8.375V7.125ZM3.15 0.875C2.71649 0.874972 2.29636 1.02516 1.96111 1.30002C1.62587 1.57487 1.39622 1.9574 1.31125 2.3825L2.53625 2.6275C2.5646 2.48566 2.64127 2.35804 2.75319 2.26641C2.86512 2.17477 3.00535 2.1248 3.15 2.125V0.875ZM4.87125 12.125C5.28279 12.125 5.68796 12.0234 6.05081 11.8292C6.41365 11.635 6.72357 11.3543 6.95188 11.0119L5.91063 10.3181C5.79651 10.4894 5.6425 10.6298 5.46108 10.727C5.27965 10.8241 5.07705 10.875 4.87125 10.875V12.125ZM10.25 2.125C10.4158 2.125 10.5747 2.19085 10.6919 2.30806C10.8092 2.42527 10.875 2.58424 10.875 2.75H12.125C12.125 2.25272 11.9275 1.77581 11.5758 1.42417C11.2242 1.07254 10.7473 0.875 10.25 0.875V2.125Z" fill="#ACACAC"/>
                  </svg>    
                  </button>
                <span>0</span>                
                  <button className="flex items-center">
                  <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.375 5.25L7.75875 5.1475C7.74387 5.237 7.74865 5.32866 7.77277 5.41612C7.79688 5.50358 7.83975 5.58474 7.89839 5.65397C7.95703 5.7232 8.03004 5.77883 8.11234 5.817C8.19465 5.85517 8.28428 5.87496 8.375 5.875V5.25ZM1.5 5.25V4.625C1.33424 4.625 1.17527 4.69085 1.05806 4.80806C0.940848 4.92527 0.875 5.08424 0.875 5.25H1.5ZM2.75 12.125H9.85V10.875H2.75V12.125ZM10.6 4.625H8.375V5.875H10.6V4.625ZM8.99187 5.3525L9.495 2.33063L8.2625 2.125L7.75875 5.1475L8.99187 5.3525ZM8.2625 0.875H8.12875V2.125H8.2625V0.875ZM6.04812 1.98813L4.47687 4.34688L5.51687 5.04063L7.08937 2.68187L6.04812 1.98813ZM3.95625 4.625H1.5V5.875H3.95625V4.625ZM0.875 5.25V10.25H2.125V5.25H0.875ZM11.6887 10.6175L12.4387 6.8675L11.2137 6.6225L10.4637 10.3725L11.6887 10.6175ZM4.47687 4.34688C4.41978 4.43245 4.34182 4.5026 4.25111 4.55112C4.1604 4.59964 4.05912 4.62502 3.95625 4.625V5.875C4.26492 5.87498 4.5688 5.79875 4.84094 5.65309C5.11308 5.50743 5.34567 5.29746 5.51687 5.04063L4.47687 4.34688ZM9.495 2.33063C9.52486 2.15159 9.51537 1.96819 9.46719 1.79319C9.419 1.61819 9.33329 1.45579 9.216 1.31726C9.09871 1.17873 8.95265 1.06742 8.78799 0.991041C8.62333 0.914666 8.44401 0.875068 8.2625 0.875V2.125L9.495 2.33063ZM10.6 5.875C10.6925 5.87496 10.7838 5.89545 10.8674 5.93499C10.951 5.97453 11.0248 6.03213 11.0835 6.10363C11.1421 6.17514 11.1842 6.25877 11.2066 6.3485C11.229 6.43823 11.2319 6.53181 11.2137 6.6225L12.4387 6.8675C12.4931 6.59553 12.4865 6.31489 12.4193 6.0458C12.3521 5.77671 12.226 5.52588 12.0502 5.31138C11.8744 5.09688 11.6532 4.92406 11.4025 4.80537C11.1519 4.68668 10.8773 4.62508 10.6 4.625V5.875ZM9.85 12.125C10.2835 12.125 10.7036 11.9748 11.0389 11.7C11.3741 11.4251 11.6038 11.0426 11.6887 10.6175L10.4637 10.3725C10.4354 10.5143 10.3587 10.642 10.2468 10.7336C10.1349 10.8252 9.99465 10.8752 9.85 10.875V12.125ZM8.12875 0.875C7.71721 0.875007 7.31204 0.976609 6.94919 1.17079C6.58635 1.36497 6.27643 1.64572 6.04812 1.98813L7.08937 2.68187C7.20349 2.51061 7.3575 2.37018 7.53892 2.27303C7.72035 2.17589 7.92295 2.12504 8.12875 2.125V0.875ZM2.75 10.875C2.58424 10.875 2.42527 10.8092 2.30806 10.6919C2.19085 10.5747 2.125 10.4158 2.125 10.25H0.875C0.875 10.7473 1.07254 11.2242 1.42417 11.5758C1.77581 11.9275 2.25272 12.125 2.75 12.125V10.875Z" fill="#ACACAC"/>
                    <path d="M4 5.25V11.5" stroke="#ACACAC"/>
                  </svg>
                  </button>
                </div>
              </div>
            </div>
          ))}         
        </div>
        <div className='flex item-center justify-evenly' >
              <form>
                <div className="flex items-center mb-4">
                  <label className="w-[140px] text-[#6C6C6C] mb-2" htmlFor="name">نام و نام خانوادگی</label>
                  <input
                    type="text"
                    id="name"
                    className="w-full h-10 p-2 border rounded-xl"
                    placeholder="نام و نام خانوادگی خود را وارد کنید"
                  />
                </div>
                <div className="flex items-center mb-4">
                  <label className="w-[140px] text-[#6C6C6C] mb-2" htmlFor="email">پست الکترونیکی</label>
                  <input
                    type="email"
                    id="email"
                    className="w-full h-10 p-2 border rounded-xl"
                    placeholder="ایمیل خود را وارد کنید"
                  />
                </div>
            <div className="flex mb-4">
              <label className="w-[140px] text-[#6C6C6C] mb-2" htmlFor="message">متن پیام</label>
              <textarea
                id="message"
                className="w-full p-2 border rounded-xl"
                placeholder="متن پیام خود را وارد کنید"
              ></textarea>
            </div>
            <button className="w-full bg-[#008080] text-white py-2 px-4 rounded-xl">ارسال نظر</button>
          </form>
          <div>
            <Image src={feedbacklogo} alt='feedback'  />
          </div>
        </div>
      </div>
    </div>
  );
};

export default Comments;